[
  {
    "title": "Graphic Design",
    "description": "Explore the fundamentals of graphic design, including color theory, typography, layout, and visual communication. Learn to create stunning designs that captivate audiences and convey your message effectively.",
    "videoLink": "https://www.youtube.com/watch?v=Nt0CQqJlD8I",
    "stars": 4,
    "id": "1"
  },
  {
    "title": "Photography",
    "description": "Dive into the art of photography and learn how to capture breathtaking images. Discover techniques for composition, lighting, and post-processing to elevate your photography skills and create visually stunning photographs.",
    "videoLink": "https://www.youtube.com/watch?v=7ZVyNjKSr0M",
    "stars": 5,
    "id": "10"
  },
  {
    "title": "UI/UX Design",
    "description": "Gain expertise in user interface (UI) and user experience (UX) design. Learn how to create intuitive, visually appealing, and user-friendly digital interfaces that enhance the overall user experience.",
    "videoLink": "https://www.youtube.com/watch?v=Ovj4hFxko7c",
    "stars": 4,
    "id": "2"
  },
  {
    "title": "Programming (various languages)",
    "description": "Explore a variety of programming languages, including Python, JavaScript, Java, and C++. Learn the fundamentals of programming, problem-solving, and algorithm development to build robust and efficient applications.",
    "videoLink": "https://www.youtube.com/watch?v=zOjov-2OZ0E",
    "stars": 5,
    "id": "20"
  },
  {
    "title": "Mobile App Development",
    "description": "Dive into the world of mobile app development and learn how to create engaging and functional applications for iOS and Android platforms. Explore mobile design principles, frameworks, and best practices to build cutting-edge mobile apps.",
    "videoLink": "https://www.youtube.com/watch?v=xSu8o2QDxSc",
    "stars": 4,
    "id": "3"
  },
  {
    "title": "Web App Development",
    "description": "Learn the skills to build dynamic and responsive web applications. Explore front-end and back-end technologies, such as HTML, CSS, JavaScript, and server-side frameworks, to create interactive and user-friendly web experiences.",
    "videoLink": "https://www.youtube.com/watch?v=3_xEEH4fTEk",
    "stars": 5,
    "id": "30"
  }
]
